{
    "primary_goal": "a great filename",
    "goals": {
        "Be concise and descriptive.": [
            "Use short and clear sentences to convey information.",
            "Eliminate unnecessary words and phrases.",
            "Avoid repetition and redundancy.",
            "Provide specific details and examples.",
            "Be mindful of the audience's level of knowledge and understanding.",
            "Use active voice instead of passive voice.",
            "Break down complex information into smaller, manageable parts.",
            "Use headings, lists, and bullet points to organize information.",
            "Proofread and edit for clarity and conciseness."
        ],
        "Include relevant keywords.": [
            "Research and identify relevant keywords for the topic or content.",
            "Incorporate keywords naturally into the text, without overstuffing.",
            "Optimize meta tags and descriptions with relevant keywords.",
            "Use different variations of keywords to maximize coverage.",
            "Consider the intent behind the search queries when selecting keywords.",
            "Monitor and adjust keyword strategy based on search engine algorithms and trends.",
            "Use long-tail keywords for specific and targeted search queries.",
            "Analyze competitors' keyword strategies for insights and ideas.",
            "Utilize keyword research tools to generate new ideas and evaluate effectiveness.",
            "Regularly update and refresh keyword strategy to stay relevant."
        ],
        "Avoid using special characters or spaces.": [
            "Edit current documents and files to remove any special characters or spaces.",
            "Create a personalized style guide to ensure future documents follow this guideline.",
            "Use software tools to automatically remove special characters and spaces from documents.",
            "Train team members on the importance of avoiding special characters and spaces in documents.",
            "Implement a company-wide policy to avoid the use of special characters and spaces in all documents.",
            "Regularly review and update all documents to ensure compliance with this policy.",
            "Provide feedback and coaching to team members who struggle with following this guideline.",
            "Conduct audits to ensure that all documents adhere to the no special characters or spaces policy.",
            "Monitor document creation and editing to catch any violations of this guideline.",
            "Maintain documentation of the policy and its implementation to ensure consistency and accountability."
        ],
        "Use appropriate file extensions.": [
            "Use the correct file extension for each file type.",
            "Familiarize yourself with common file extensions.",
            "Ensure that file extensions are visible.",
            "Ensure that file extensions are accurate and relevant.",
            "Choose file extensions that are supported by the software or platform you are using.",
            "Avoid using inappropriate or outdated file extensions.",
            "Be consistent in your use of file extensions.",
            "Use descriptive and meaningful file names.",
            "Avoid using special characters in file names or extensions.",
            "Use file extensions to indicate file format or purpose."
        ],
        "Ensure the filename is easily recognizable.": [
            "Use descriptive words to name the file.",
            "Include relevant keywords in the name.",
            "Avoid using special characters or symbols.",
            "Use a consistent naming convention.",
            "Include the date or version number in the name.",
            "Consider the file's content and purpose when naming it.",
            "Avoid using abbreviations or acronyms that may be confusing.",
            "Include the file type extension in the name.",
            "Avoid using long or overly complicated names.",
            "Ensure the name is easy to read and understand."
        ],
        "Include version or date information if necessary.": [
            "Check the document or file for existing version or date information.",
            "If none exists, determine the appropriate format and location for including the information.",
            "Add the version or date information to the document or file.",
            "Consider including a brief description of changes made since the previous version or date.",
            "Ensure that the information is clear, accurate, and consistent with company or project standards.",
            "Update any relevant metadata or tracking systems.",
            "Archive previous versions or dates for future reference.",
            "Communicate the updated version or date information to relevant stakeholders.",
            "Verify that the updated information is accessible and visible to those who need it.",
            "Consider setting up a notification system for future updates."
        ],
        "Consider the context of the file and its intended purpose.": [
            "Identify the target audience and their specific needs.",
            "Research the industry or topic related to the file.",
            "Analyze the tone and style appropriate for the intended purpose.",
            "Consider the format and layout for optimal readability.",
            "Ensure accurate and up-to-date information.",
            "Tailor the language and content to the audience's level of understanding.",
            "Review and edit for clarity, conciseness, and accuracy.",
            "Ensure the file is accessible and easy to navigate.",
            "Include appropriate citations and references.",
            "Consider the potential impact and consequences of the file's contents."
        ],
        "Avoid using generic or vague names.": [
            "Use specific and descriptive language to convey ideas.",
            "Avoid using overused or cliched phrases.",
            "Provide concrete examples and details.",
            "Choose precise and accurate words.",
            "Use active voice instead of passive voice.",
            "Avoid using vague pronouns or references.",
            "Use language that is appropriate for the audience and purpose.",
            "Be mindful of cultural or regional differences in language.",
            "Avoid using jargon or technical terms without explanation.",
            "Proofread carefully for clarity and accuracy."
        ],
        "Ensure the filename is easy to spell and remember.": [
            "Use descriptive and relevant words in the filename.",
            "Avoid using special characters or symbols.",
            "Make sure the filename is not too long.",
            "Use capital letters to differentiate words.",
            "Include the date or version number in the filename if necessary.",
            "Test the filename by saying it aloud and spelling it out.",
            "Consider the context in which the file will be used.",
            "Choose a consistent naming convention for all files.",
            "Avoid using abbreviations or acronyms that may not be universally understood.",
            "Ask someone else to proofread and approve the filename before finalizing it."
        ],
        "Avoid using abbreviations unless they are widely recognized.": [
            "Use complete words instead of acronyms or initialisms.",
            "Spell out words that are commonly abbreviated, such as \"Street\" instead of \"St.\"",
            "Avoid using jargon or technical terms without explanation.",
            "Be mindful of language barriers and use simple, clear language.",
            "Use context to clarify any potentially confusing abbreviations.",
            "Proofread and edit to ensure clarity and accuracy.",
            "Provide definitions or explanations for any necessary abbreviations.",
            "Consider the audience and their familiarity with industry-specific abbreviations.",
            "Use well-known abbreviations, such as \"NASA\" or \"FBI,\" sparingly and only when necessary."
        ]
    },
    "completed_goals": []
}